last_month = [
    "Повышение инфляции повышает спрос на золото как средство защиты от обесценивания валюты.",
    "Экономическая неопределенность, вызванная геополитическими событиями или экономическим спадом, приводит к увеличению вложений в золото.",
    "Снижение процентных ставок делает золото более привлекательным активом, поскольку доходность облигаций снижается",
    "Рост спроса на ювелирные изделия в таких странах, как Китай и Индия, повышает цену на золото.",
    "Инвестиции центральных банков в золото рассматриваются как признак стабильности и снижения риска.",
    "Повышение технологического спроса на золото в таких областях, как электроника и медицина, способствует росту цен",
    "Мировые события, такие как войны или террористические акты, могут привести к паническим покупкам золота и повышению цен.",
    "Курсовые колебания валют могут повлиять на спрос и предложение золота, поскольку оно оценивается в долларах США.",
    "Технический анализ, такой как диаграммы и индикаторы, используется для выявления тенденций и прогнозирования будущих движений цен на золото.",
    "Спекуляции также могут влиять на цену на золото, особенно во время резких движений рынка",
]

last_year = [
    "Цена на золото достигла максимума за 9 месяцев на фоне опасений по поводу рецессии (январь)",
    "Центральные банки продолжают наращивать свои золотые резервы (февраль)",
    "Спрос на ювелирные изделия из золота в Индии достиг рекордного уровня (март)",
    "Инвесторы возвращаются к золоту на фоне геополитической неопределенности (апрель)",
    "Цена на золото превысила 1900 долларов за унцию после публикации данных о высокой инфляции в США (май)",
    "Федеральная резервная система повысила процентные ставки, что привело к некоторому снижению цены на золото (июнь)",
    "Китай увеличил свой золотой импорт на 138% в первом полугодии 2023 года (июль)",
    "Мировой спрос на золото вырос на 18% в первом квартале 2023 года (август)",
    "Золото превзошло все другие основные классы активов в 2023 году (октябрь)",
]

other_inform = [
    "Золото исторически служило средством защиты от обесценивания валюты, поскольку его стоимость имеет тенденцию "
    "расти во время периодов высокой инфляции.Безопасный гавань: Золото рассматривается как безопасный актив во время "
    "экономической неопределенности или геополитических потрясений, что приводит к увеличению спроса и повышению цен. "
]

dollar = [
    "Доллар США достиг 20-летнего максимума по отношению к другим основным валютам (сентябрь)",
    "Федеральная резервная система повысила процентные ставки на 75 базисных пунктов, что привело к дальнейшему росту доллара (сентябрь)",
    "Индекс доллара США достиг 114,5, самого высокого уровня с мая 2002 года (октябрь)",
    "Укрепление доллара оказывает давление на валюты развивающихся рынков и сырьевые товары (октябрь)",
    "Торговый дефицит США вырос до рекордного уровня в 94,8 миллиарда долларов (октябрь)",
    "Министерство финансов США заявило, что готово использовать все доступные инструменты для поддержки доллара (октябрь)",
    "Международный валютный фонд призвал к скоординированным действиям для стабилизации доллара (октябрь)",
    "Китайские власти предприняли шаги для поддержки юаня, опасаясь дальнейшего ослабления (октябрь)",
    "Укрепление доллара оказывает давление на глобальный экономический рост (ноябрь)",
    "Доллар США немного ослаб после заявления ФРС о том, что темпы повышения процентных ставок могут замедлиться (ноябрь)"
]
